In [142]:
import pandas as pd
import numpy as np

In [108]:
sozluk={"ali":25,"veli":30,"büşra":20}
pd.Series(sozluk)

ali      25
veli     30
büşra    20
dtype: int64

In [109]:
isimler=["ali","veli","büşra"]
yaslar=[25,30,20]
pd.Series(data=yaslar,index=isimler)

ali      25
veli     30
büşra    20
dtype: int64

In [110]:
sonuc1=[10,8,4]
sonuc2=[9,4,8]
pd.Series(sonuc1,isimler)+pd.Series(sonuc2,isimler)

ali      19
veli     12
büşra    12
dtype: int64

In [111]:
isimler2=["ali","yako"]
sonuc3=[5,7]
pd.Series(sonuc3,isimler2)+pd.Series(sonuc2,isimler)

ali      14.0
büşra     NaN
veli      NaN
yako      NaN
dtype: float64

In [112]:
veri=np.random.randn(4,3)
dataFrame=pd.DataFrame(veri)

In [113]:
dataFrame

          0         1         2
0  0.357848 -0.383827  0.385672
1  0.126924  1.747282  0.216885
2 -1.609238 -1.471568 -0.203738
3  0.237109  0.942797  1.096043

In [114]:
yenidataframe=pd.DataFrame(veri,index=["ali","veli","büşra","yako"],columns=["yas","maas","süre"])

In [115]:
yenidataframe

            yas      maas      süre
ali    0.357848 -0.383827  0.385672
veli   0.126924  1.747282  0.216885
büşra -1.609238 -1.471568 -0.203738
yako   0.237109  0.942797  1.096043

In [116]:
yenidataframe["maas"]

ali     -0.383827
veli     1.747282
büşra   -1.471568
yako     0.942797
Name: maas, dtype: float64

In [117]:
yenidataframe[["yas","süre"]]

            yas      süre
ali    0.357848  0.385672
veli   0.126924  0.216885
büşra -1.609238 -0.203738
yako   0.237109  1.096043

In [118]:
yenidataframe.loc["yako"]

yas     0.237109
maas    0.942797
süre    1.096043
Name: yako, dtype: float64

In [119]:
yenidataframe.iloc[1]

yas     0.126924
maas    1.747282
süre    0.216885
Name: veli, dtype: float64

In [120]:
yenidataframe["izin"]=yenidataframe["süre"]*2

In [121]:
yenidataframe

            yas      maas      süre      izin
ali    0.357848 -0.383827  0.385672  0.771344
veli   0.126924  1.747282  0.216885  0.433770
büşra -1.609238 -1.471568 -0.203738 -0.407476
yako   0.237109  0.942797  1.096043  2.192087

In [122]:
yenidataframe.drop("izin",axis=1)

            yas      maas      süre
ali    0.357848 -0.383827  0.385672
veli   0.126924  1.747282  0.216885
büşra -1.609238 -1.471568 -0.203738
yako   0.237109  0.942797  1.096043

In [123]:
yenidataframe.drop("veli")

            yas      maas      süre      izin
ali    0.357848 -0.383827  0.385672  0.771344
büşra -1.609238 -1.471568 -0.203738 -0.407476
yako   0.237109  0.942797  1.096043  2.192087

In [124]:
yenidataframe

            yas      maas      süre      izin
ali    0.357848 -0.383827  0.385672  0.771344
veli   0.126924  1.747282  0.216885  0.433770
büşra -1.609238 -1.471568 -0.203738 -0.407476
yako   0.237109  0.942797  1.096043  2.192087

In [125]:
yenidataframe.drop("izin",axis=1,inplace=True)

In [126]:
yenidataframe

            yas      maas      süre
ali    0.357848 -0.383827  0.385672
veli   0.126924  1.747282  0.216885
büşra -1.609238 -1.471568 -0.203738
yako   0.237109  0.942797  1.096043

In [127]:
yenidataframe.loc["yako"]

yas     0.237109
maas    0.942797
süre    1.096043
Name: yako, dtype: float64

In [128]:
yenidataframe.loc["yako"]["maas"]

0.9427973878372478

In [129]:
yenidataframe.loc["yako","maas"]

0.9427973878372478

In [130]:
booleanFrame=yenidataframe["süre"]<0

In [131]:
booleanFrame

ali      False
veli     False
büşra     True
yako     False
Name: süre, dtype: bool

In [132]:
yenidataframe[booleanFrame]

            yas      maas      süre
büşra -1.609238 -1.471568 -0.203738

In [133]:
yeniindexlistesi=["a","b","c","d"]
yenidataframe["yeniindex"]=yeniindexlistesi

In [134]:
yenidataframe

            yas      maas      süre yeniindex
ali    0.357848 -0.383827  0.385672         a
veli   0.126924  1.747282  0.216885         b
büşra -1.609238 -1.471568 -0.203738         c
yako   0.237109  0.942797  1.096043         d

In [135]:
yenidataframe.set_index("yeniindex")

                yas      maas      süre
yeniindex
a          0.357848 -0.383827  0.385672
b          0.126924  1.747282  0.216885
c         -1.609238 -1.471568 -0.203738
d          0.237109  0.942797  1.096043

In [136]:
yenidataframe

            yas      maas      süre yeniindex
ali    0.357848 -0.383827  0.385672         a
veli   0.126924  1.747282  0.216885         b
büşra -1.609238 -1.471568 -0.203738         c
yako   0.237109  0.942797  1.096043         d

In [137]:
yenidataframe.set_index("yeniindex",inplace=True)

In [138]:
yenidataframe

                yas      maas      süre
yeniindex
a          0.357848 -0.383827  0.385672
b          0.126924  1.747282  0.216885
c         -1.609238 -1.471568 -0.203738
d          0.237109  0.942797  1.096043

In [139]:
yenidataframe.loc["a"]

yas     0.357848
maas   -0.383827
süre    0.385672
Name: a, dtype: float64

In [151]:
disindex=["ENG","ENG","TUR","TUR","GER","GER"]
icindex=["liverpool","leicester","galatasaray","eskişehirspor","dortmund","münih"]
birlesik=list(zip(disindex,icindex))
birlesik=pd.MultiIndex.from_tuples(birlesik)

birlesik=pd.MultiIndex.from_tuples(birlesik)
birlesik

In [152]:
oyuncular=[["salah",28],["vardy",21],["muslera",31],["hürriyet",41],["götze",35],["lewan",32]]
oyuncularnp=np.array(oyuncular)
oyunculardf=pd.DataFrame(oyuncularnp,index=birlesik,columns=["isim","yas"])

In [153]:
oyunculardf

                       isim yas
ENG liverpool         salah  28
    leicester         vardy  21
TUR galatasaray     muslera  31
    eskişehirspor  hürriyet  41
GER dortmund          götze  35
    münih             lewan  32

In [154]:
oyunculardf.loc["TUR"]

                   isim yas
galatasaray     muslera  31
eskişehirspor  hürriyet  41

In [155]:
oyunculardf.index.names=["ülke","takım"]
oyunculardf

                        isim yas
ülke takım
ENG  liverpool         salah  28
     leicester         vardy  21
TUR  galatasaray     muslera  31
     eskişehirspor  hürriyet  41
GER  dortmund          götze  35
     münih             lewan  32